# Yay

tap 'homebrew/services'

## Upgrades & Overlays

brew 'bat'
brew 'btop'
brew 'curl'
brew 'eza'
brew 'fd'
brew 'gawk'
brew 'gnu-sed' # Spectre needs this
brew 'httpie'
brew 'mosh'
brew 'openssh'
brew 'ripgrep'
brew 'rsync'
brew 'tmux'
brew 'watch'
brew 'wget'
brew 'whois'
brew 'zoxide'

## Fun stuff

brew 'ffmpeg'
brew 'ffmpegthumbnailer'
brew 'fish'
brew 'fzf'
brew 'handbrake'
brew 'hugo'
brew 'imagemagick'
brew 'marp-cli' # slides
brew 'neofetch'
brew 'poppler'
brew 'qpdf'
brew 'tintin'
brew 'tlrc'
brew 'trash-cli'
brew 'unar'
brew 'yazi'
brew 'yt-dlp'

## Dev Tooling

brew 'neovim'
brew 'direnv'
brew 'entr'
brew 'gh'
brew 'git'
brew 'git-lfs'
brew 'git-standup'
brew 'go'
brew 'golangci-lint'
brew 'jq'
brew 'libpq'
brew 'overmind'
brew 'pipx'

tap 'goreleaser/tap'
brew 'goreleaser/tap/goreleaser'

tap 'heroku/brew'
brew 'heroku/brew/heroku'

tap 'jesseduffield/lazygit'
brew 'jesseduffield/lazygit/lazygit'

## Ops Tooling

brew 'dive'
brew 'gnupg'
brew 'nmap'
brew 'qrencode'
brew 'wireguard-tools'

tap '1password/tap'
cask '1password/tap/1password-cli'

tap 'hashicorp/tap'
brew 'hashicorp/tap/terraform'

tap 'jesseduffield/lazydocker'
brew'jesseduffield/lazydocker/lazydocker'

## MAS time

brew 'mas'
