## Base Taps
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
tap "homebrew/services"

## Packages
brew "cowsay"
brew "curl"
brew "direnv"
brew "exa"
brew "fd"
brew "fish"
brew "fortune"
brew "fzf"
brew "gawk"
brew "gnupg"
brew "httpie"
brew "mosh"
brew "neovim"
brew "nmap"
brew "pinentry-mac"
brew "reattach-to-user-namespace"
brew "ripgrep"
brew "thefuck"
brew "tintin"
brew "tmux"
brew "tree"
brew "watch"
brew "wget"
brew "whois"
brew "youtube-dl"

brew "theseal/ssh-askpass/ssh-askpass"
tap "theseal/ssh-askpass"

## Dev Tooling
brew "asdf"
brew "exercism"
brew "git"
brew "git-lfs"
brew "git-standup"
brew "go"
brew "hub"
brew "hugo"
brew "jq"
brew "overmind"
brew "pipenv"
brew "python"
brew "shellcheck"

tap "heroku/brew"
brew "heroku/brew/heroku"

## Ops Tooling
brew "awscli"
brew "bind"
brew "kubernetes-cli"
brew "minikube"
brew "packer"
brew "terraform"
brew "vault"

cask "vagrant"

tap "chef/chef"
cask "chef-workstation"

tap "habitat-sh/habitat"
brew "habitat-sh/habitat/hab"

## Casks

## MAS time
brew "mas"
mas "1Password 7", id: 1333542190
mas "Cardhop", id: 1290358394
mas "Clocks", id: 414554506
mas "Day One", id: 1055511498
mas "Deliveries", id: 924726344
mas "Double Shot", id: 1076145960
mas "Due", id: 524373870
mas "FreeSpace", id: 457520846
mas "Image2icon", id: 992115977
mas "Keynote", id: 409183694
mas "MindNode", id: 1289197285
mas "Momentum", id: 1030442215
mas "NextDNS", id: 1464122853
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "Paprika Recipe Manager 3", id: 1303222628
mas "Patterns", id: 429449079
mas "Postico", id: 1031280567
mas "Push Mic Control", id: 1155850258
mas "Reeder", id: 1449412482
mas "Screenium 3", id: 921553264
mas "Screens", id: 1224268771
mas "SiteSucker", id: 442168834
mas "SnippetsLab", id: 1006087419
mas "Soulver", id: 413965349
mas "The Unarchiver", id: 425424353
mas "Things", id: 904280696
mas "Tweetbot", id: 1384080005
mas "Ulysses", id: 1225570693
mas "Xcode", id: 497799835
