## Base Taps
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
tap "homebrew/services"

## Packages
brew "cowsay"
brew "curl"
brew "direnv"
brew "exa"
brew "fd"
brew "fish"
brew "fortune"
brew "fzf"
brew "gawk"
brew "gnupg"
brew "httpie"
brew "libdvdcss"
brew "mosh"
brew "neovim"
brew "nmap"
brew "pinentry-mac"
brew "reattach-to-user-namespace"
brew "ripgrep"
brew "tintin"
brew "tmux"
brew "tree"
brew "watch"
brew "wget"
brew "whois"
brew "wireguard-tools"
brew "youtube-dl"

tap "theseal/ssh-askpass"
brew "theseal/ssh-askpass/ssh-askpass"

## Dev Tooling
brew "asdf"
brew "exercism"
brew "git"
brew "git-lfs"
brew "git-standup"
brew "go"
brew "hub"
brew "hugo"
brew "jq"
brew "overmind"
brew "shellcheck"

tap "github/gh"
brew "github/gh/gh"

tap "heroku/brew"
brew "heroku/brew/heroku"

## Ops Tooling
brew "awscli"
brew "bind"
brew "consul"
brew "dive"
brew "kubernetes-cli"
brew "minikube"
brew "packer"
brew "terraform"
brew "vault"

cask "vagrant"
cask "docker"

tap "chef/chef"
cask "chef-workstation"

## Casks
# Arq 5
# FireFox
# GoogleChrome
# iTerm
# JetBrains Toolbox
# SublimeText
# SublimeMerge
# Slack

## MAS time
brew "mas"

# 1Password
# Be Focused Pro
