# Yay

tap 'homebrew/services'

## Upgrades & Overlays

brew 'bat'
brew 'bat-extras'
brew 'btop'
brew 'curl'
brew 'eza'
brew 'fd'
brew 'fzf'
brew 'gawk'
brew 'mosh'
brew 'ncdu'
brew 'neovim'
brew 'openssh'
brew 'ripgrep'
brew 'rsync'
brew 'tmux'
brew 'watch'
brew 'wget'
brew 'whois'
brew 'zoxide'

## Deps for other apps

brew 'ast-grep' # neovim
brew 'chafa' # neovim fzf
brew 'cmake' # neovim
brew 'gnu-sed' # neovim Spectre
brew 'poppler' # yazi
brew 'sevenzip' #yazi
brew 'viu' # neovim fzf
brew 'luarocks' #neovim

## Fun stuff

brew 'fastfetch'
brew 'ffmpeg'
brew 'hugo'
brew 'imagemagick'
brew 'marp-cli' # slides
brew 'media-info'
brew 'msmtp'
brew 'qpdf' # moar pdf
brew 'syncthing'
brew 'tintin'
brew 'tlrc'
brew 'yazi'
brew 'yt-dlp'

## File Manglers

brew 'csvlens'
brew 'fx'
brew 'jq'
brew 'miller'
brew 'qrencode'
brew 'yq'

## Dev & Ops Tooling

brew 'asdf'
brew 'curlie'
brew 'direnv'
brew 'dive'
brew 'entr'
brew 'gh'
brew 'git'
brew 'git-delta'
brew 'git-lfs'
brew 'git-standup'
brew 'git-xargs'
brew 'gnupg'
brew 'go'
brew 'golangci-lint'
brew 'just'
brew 'libpq'
brew 'nmap'
brew 'overmind'
brew 'tf-summarize'
brew 'tflint'
brew 'wireguard-tools'

tap 'goreleaser/tap'
brew 'goreleaser/tap/goreleaser'

tap 'jesseduffield/lazygit'
brew 'jesseduffield/lazygit/lazygit'

tap 'jesseduffield/lazydocker'
brew 'jesseduffield/lazydocker/lazydocker'

tap 'hashicorp/tap'
brew 'hashicorp/tap/terraform'

tap '1password/tap'
cask '1password/tap/1password-cli'

## MAS time

brew 'mas'
