# Yay

## Upgrades & Overlays

brew 'bat'
brew 'bat-extras'
brew 'btop'
brew 'curl'
brew 'eza'
brew 'fd'
brew 'fzf'
brew 'gawk'
brew 'mosh'
brew 'ncdu'
brew 'neovim'
brew 'openssh'
brew 'ripgrep'
brew 'rsync'
brew 'tmux'
brew 'watch'
brew 'wget'
brew 'whois'
brew 'zoxide'

## Deps for other apps

brew 'ast-grep'        # neovim
brew 'cmake'           # neovim
brew 'gnu-sed'         # neovim Spectre
brew 'poppler'         # yazi
brew 'sevenzip'        # yazi
brew 'luarocks'        # neovim
brew 'tree-sitter-cli' # neovim

## Fun stuff

brew 'fastfetch'
brew 'ffmpeg'
brew 'hugo'
brew 'imagemagick'
brew 'marp-cli' # slides
brew 'media-info'
brew 'msmtp'
brew 'qpdf' # moar pdf
brew 'syncthing', restart_service: true
brew 'tintin'
brew 'tlrc'
brew 'yazi'
brew 'yt-dlp'

## File Manglers

brew 'csvlens'
brew 'fx'     # json browser
brew 'jq'
brew 'miller' # mill positional data
brew 'qrencode'
brew 'yq'     # yaml query

## Dev & Ops Tooling

brew 'asdf'
brew 'direnv'
brew 'dive'
brew 'entr'
brew 'gh'
brew 'git'
brew 'git-delta'
brew 'git-lfs'
brew 'git-standup'
brew 'git-xargs'
brew 'gnupg'
brew 'go'
brew 'golangci-lint'
brew 'just'
brew 'libpq'
brew 'nmap'
brew 'overmind'
brew 'restic'
brew 'tf-summarize'
brew 'tflint'
brew 'uv'
brew 'wireguard-tools'
brew 'xh' # httpie replacement
brew 'lazygit'
brew 'goreleaser'

cask "1password-cli" if OS.mac?

tap 'jesseduffield/lazydocker'
brew 'jesseduffield/lazydocker/lazydocker'

tap 'hashicorp/tap'
brew 'hashicorp/tap/terraform'

## MAS time

brew 'mas' if OS.mac?
