brew "asdf"
brew "bat"
brew "bat-extras"
brew "btop"
brew "claude-squad"
brew "cmake"
brew "csvlens"
brew "curl"
brew "delve"
brew "direnv"
brew "dive"
brew "entr"
brew "entr" # File watcher for automation
brew "eslint"
brew "eza"
brew "fastfetch"
brew "fd"
brew "ffmpeg"
brew "fish"
brew "fx" # json browser
brew "fzf"
brew "gawk"
brew "gh"
brew "git"
brew "git-delta"
brew "git-lfs"
brew "git-standup"
brew "git-xargs"
brew "gnupg"
brew "go"
brew "golangci-lint"
brew "gopls"
brew "goreleaser"
brew "hugo"
brew "imagemagick"
brew "jq" # json parser
brew "just"
brew "lazygit"
brew "libpq"
brew "marp-cli"
brew "mas"
brew "media-info"
brew "miller" # awk++ for structured data
brew "mosh"
brew "msmtp"
brew "ncdu"
brew "nmap"
brew "openssh"
brew "overmind"
brew "poppler"
brew "prettier"
brew "python3"
brew "qpdf"
brew "qrencode"
brew "restic"
brew "ripgrep"
brew "rsync"
brew "ruff"
brew "sevenzip"
brew "syncthing", restart_service: :changed
brew "tea"
brew "tf-summarize"
brew "tintin"
brew "tlrc"
brew "tmux"
brew "ty"
brew "typescript"
brew "typescript-language-server"
brew "uv"
brew "vtsls"
brew "watch"
brew "wget"
brew "whois"
brew "wireguard-tools"
brew "xh" # httpie replacement
brew "yazi"
brew "yq" # yaml parser
brew "yt-dlp"
brew "zoxide"

# NeoVim mass
brew "neovim"

brew "ast-grep" # grug-far
brew "chafa" # fzf-lua
brew "node@24"
brew "tree-sitter"
brew "tree-sitter-cli"
brew "viu" # fzf-lua

# lua
brew "lua-language-server"
brew "lua"
brew "luarocks"
brew "stylua"

# markdown
brew "markdownlint-cli2"
brew "marksman"

# configuration
# brew "fixjson"
brew "tombi"
brew "vacuum"
brew "vscode-langservers-extracted" # json, html, css
brew "yaml-language-server"
brew "yamlfmt"
brew "yamllint"

# shells
brew "bash-language-server"
brew "fish-lsp"
brew "shellcheck"
brew "shfmt"

# docker
brew "docker-compose-langserver"
brew "docker-language-server"
brew "hadolint"

tap "hashicorp/tap"
brew "hashicorp/tap/terraform"

tap "jesseduffield/lazydocker"
brew "jesseduffield/lazydocker/lazydocker"

cask "1password-cli"
cask "espanso"

go "github.com/StackExchange/dnscontrol/v4"

cargo "bandsnatch"
cargo "sqlx-cli"

mas "1Blocker", id: 1365531024
mas "1Password for Safari", id: 1569813296
mas "Color Picker", id: 1545870783
mas "Double Shot", id: 1076145960
mas "Email Me", id: 1090744587
mas "FreeSpace", id: 457520846
mas "Good Stopwatch", id: 1268456701
mas "Good Timer", id: 1268457877
mas "Hand Mirror", id: 1502839586
mas "Image2Icon", id: 992115977
mas "Infuse", id: 1136220934
mas "Keynote", id: 409183694
mas "Kindle", id: 302584613
mas "krita", id: 1594607976
mas "Magnet", id: 441258766
mas "Mela", id: 1568924476
mas "MindNode Classic", id: 1289197285
mas "Mp3tag", id: 1532597159
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "Parcel", id: 375589283
mas "Pixelmator Pro", id: 1289583905
mas "reMarkable", id: 1276493162
mas "Simple Comic", id: 1497435571
mas "Soulver 3", id: 1508732804
mas "TestFlight", id: 899247664
mas "The Unarchiver", id: 425424353
